def parse_input(user_input) -> tuple[str, list[str]]:
    """
    Функція-парсер - яка приймає рядок вводу користувача user_input і розбиває його на слова за допомогою методу split(). 
    Вона повертає перше слово як команду cmd та решту як список аргументів *args. Рядок коду cmd, *args = user_input.split() 
    розділяє рядок на слова. Перше слово зберігається у змінній cmd, а решта зберігається у списку args завдяки оператору розпакування *. 
    Далі рядок коду cmd = cmd.strip().lower() видаляє зайві пробіли навколо команди та перетворює її на нижній регістр.
    
    """
    cmd, *args = user_input.split()
    cmd = cmd.strip().lower()
    return cmd, *args